{
  "format": "layers-model",
  "generatedBy": "keras v2.12.0",
  "convertedBy": "exported by export_tfjs.py (PyTorch -> TF.js)",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "movie_recommender",
      "layers": [
        {
          "class_name": "Embedding",
          "config": {
            "name": "movie_embedding",
            "trainable": false,
            "dtype": "float32",
            "batch_input_shape": [
              null,
              1
            ],
            "input_dim": 9724,
            "output_dim": 50,
            "embeddings_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "embeddings_regularizer": null,
            "activity_regularizer": null,
            "embeddings_constraint": null,
            "mask_zero": false,
            "input_length": 1
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "movie_embedding/embeddings",
          "shape": [
            9724,
            50
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}